#+title: Readme

*** terrain set
#+begin_src lisp :package worldconf :results value table
(defun terrain-set-to-org-table (ts)
  (append
   nil
    ;; (list "name" "id" "color" "margin" "spacing" "imagepath")
    (mapcar #'(lambda (item)
                (let* ((item* (cdr item))
                        (tileset (getf item* :tileset)))
                    (list
                    (getf item* :name)
                    (getf item* :id)
                    (getf item* :priority)
                    (getf item* :wang-tiles)
                    (format nil "#~6,'0x"
                      (getf item* :color))
                    (tiledmap:margin tileset)
                    (tiledmap:spacing tileset)
                    (format nil "~a"
                      (tiledmap:image tileset)))))
            ts)))
    (terrain-set-to-org-table *terrain-set*)

#+end_src

#+RESULTS:
| deep-underwater |  0 |     0 | :TERRAIN       | #B7C4CF | 0 | 0 | /home/mik/joegame/assets/images/terr_trench.png      |
| ocean           |  1 |  1000 | :THICK-TERRAIN | #B7C4CF | 0 | 0 | /home/mik/joegame/assets/images/terr_ocean.png       |
| algea-ocean     |  2 |  2000 | :THICK-TERRAIN | #B7C4CF | 0 | 0 | /home/mik/joegame/assets/images/terr_water.png       |
| clay2           |  3 |  3000 | :TERRAIN       | #A9612D | 0 | 0 | generated_terr_clay2.png                             |
| terr_clay2_50   |  4 |  4000 | :TERRAIN       | #A9612D | 0 | 0 | generated_terr_clay2_50.png                          |
| terr_clay2_100  |  5 |  5000 | :TERRAIN       | #A9612D | 0 | 0 | generated_terr_clay2_100.png                         |
| terr_clay2_200  |  6 |  6000 | :TERRAIN       | #A9612D | 0 | 0 | generated_terr_clay2_200.png                         |
| terr_clay2_300  |  7 |  7000 | :TERRAIN       | #A9612D | 0 | 0 | generated_terr_clay2_300.png                         |
| terr_clay2_400  |  8 |  8000 | :TERRAIN       | #A9612D | 0 | 0 | generated_terr_clay2_400.png                         |
| terr_clay2_500  |  9 |  9000 | :TERRAIN       | #A9612D | 0 | 0 | generated_terr_clay2_500.png                         |
| terr_clay2_600  | 10 | 10000 | :TERRAIN       | #A9612D | 0 | 0 | generated_terr_clay2_600.png                         |
| terr_clay2_700  | 11 | 11000 | :TERRAIN       | #A9612D | 0 | 0 | generated_terr_clay2_700.png                         |
| terr_clay2_800  | 12 | 12000 | :TERRAIN       | #A9612D | 0 | 0 | generated_terr_clay2_800.png                         |
| terr_clay2_900  | 13 | 13000 | :TERRAIN       | #A9612D | 0 | 0 | generated_terr_clay2_900.png                         |
| terr_clay2_999  | 14 | 14000 | :TERRAIN       | #A9612D | 0 | 0 | generated_terr_clay2_999.png                         |
| clay            | 15 | 15000 | :TERRAIN       | #C38154 | 0 | 0 | /home/mik/joegame/assets/images/terr_clay.png        |
| simple-dirt     | 16 | 16000 | :TERRAIN       | #007E76 | 0 | 0 | /home/mik/joegame/assets/images/terr_dirt.png        |
| dirt            | 17 | 17000 | :TERRAIN       | #007E76 | 0 | 0 | /home/mik/joegame/assets/images/terr_dirt.png        |
| grass-patches   | 18 | 18000 | :TERRAIN       | #A0D8B3 | 0 | 0 | /home/mik/joegame/assets/images/terr_grass_patch.png |
| grass           | 19 | 19000 | :TERRAIN       | #A0D8B3 | 0 | 0 | /home/mik/joegame/assets/images/terr_grass.png       |
| deep-grass      | 20 | 20000 | :TERRAIN       | #A2A378 | 0 | 0 | /home/mik/joegame/assets/images/terr_grass.png       |
| sand            | 21 | 21000 | :TERRAIN       | #EEE3CB | 0 | 0 | /home/mik/joegame/assets/images/terr_sand.png        |
| hard-sand       | 22 | 22000 | :TERRAIN       | #D7C0AE | 0 | 0 | /home/mik/joegame/assets/images/terr_sand2.png       |
| stone           | 23 | 23000 | :TERRAIN       | #D6E8DB | 0 | 0 | /home/mik/joegame/assets/images/terr_sand.png        |
| cliff           | 24 | 24000 | :TERRAIN       | #000000 | 0 | 0 | /home/mik/joegame/assets/images/terr_sand.png        |
| stone           | 25 | 25000 | :TERRAIN       | #F6F1F1 | 0 | 0 | /home/mik/joegame/assets/images/terr_cobble.png      |
| ice             | 26 | 26000 | :TERRAIN       | #AFD3E2 | 0 | 0 | /home/mik/joegame/assets/images/terr_ice.png         |
| lake            | 27 | 27000 | :THICK-TERRAIN | #AFD3E2 | 0 | 0 | /home/mik/joegame/assets/images/terr_water.png       |
***** sources
#+begin_src sqlite :db db.db
select * from sources;
#+end_src

#+RESULTS:
| 9 | default | joegame.org |
***** images
#+begin_src sqlite :db db.db :header on
select images.name,imagesmeta.id,imagesmeta.source,images.hash from imagesmeta join images on images.id=imagesmeta.id order by random() limit 12;
#+end_src

#+RESULTS:
| name                                     |    id | source | hash                                                             |
| ME_Singles_Camping_32x32_Tree_251.png    |  8618 |      9 | fe14fe4d867a739959e8fb7f21553b10d246b3831d2fd53bf1b1d355f349e70f |
| rank054.png                              | 51411 |      9 | a59bf79a16359ce4c638c003635ea69db2fe756eecd0ecd46516932578c3bd31 |
| tileN.png                                | 47901 |      9 | 03995b8d736180b60264e5487f913e4a7952931e657262615ed84adc37f84aee |
| tile_0063.png                            | 28937 |      9 | 11195882f40a840cca2e16fca3812bdc4dd729ccc661770206ba97d046afde48 |
| ME_Singles_Garden_16x16_Fountain_1_3.png |  6611 |      9 | de17bfe76897505901179695b38b49701631dbb9e9d76992c59e2c92ec1971e8 |
| emote_stars.png                          | 26260 |      9 | b2907fb91e64a6ac5c33dd789d8a2dbc58542f99eec4cdaa05bcf9b3d2eab598 |
| man_point.png                            | 33094 |      9 | 2bc764307eeba301bc828b0e764e53f3a0f2213133bf2881b52c4ffaf92db616 |
| ME_Singles_Camping_32x32_Tree_13.png     |  8934 |      9 | 8e8a17052b6fe0cc601e129a41923c4b9be12c4cbf0248a919eb0f773853e9b2 |
| emote_alert.png                          | 26000 |      9 | 1e34bc727cf5b823d6b4b2c6fa26df897658056389cca6b623f668d2e31d6593 |
| tag_8.png                                | 45182 |      9 | 4d7d4098df4979a9824d7847dd92c8a29ca43ac8fbd543d53a02c4fab825ec58 |
| monkey.png                               | 45592 |      9 | fdbe1a404dfea9fdb7d8a353773ef774d6c3e37e0919d4a2a9a20317304ed49a |
| elementStone015.png                      | 37552 |      9 | 430fc1e80328866181144d90a5223941b217b0c02e7a42d6eb9e772f008ab4bd |
***** objects

#+begin_src sqlite :db db.db
INSERT INTO objects(image,name,tiles,tilesWidth) values (123, 'testobject', '[1, 2, 3, 4, 5, 6]', 2)
#+end_src

#+begin_src sqlite :db db.db
SELECT json(tiles), name, tilesWidth from objects limit 2;
#+end_src

#+RESULTS:
| [1,2,3,4,5,6] | testobject | 2 |
